{
    "navbar": {
        "home": "Accueil",
        "github": "GitHub",
        "linkedin": "LinkedIn",
        "resume": "CV"
    },
    "welcome": "Bienvenue!",
    "name": "Je suis Julia B.Grenier,",
    "title": "une étudiante en génie logiciel en stage coop",
    "checkout": "Visitez ces liens pour voir ce que j'ai réalisé",
    "sections" : {
        "skills": "Compétences",
        "experience_short": "Expérience",
        "experience": "Expérience en Génie Logiciel",
        "projects": "Projets" 
    },
    "skills": {
        "cpp": "Après avoir réalisé de petits projets et jeux en C++, j'ai appliqué mes connaissances lors de mes stages en génie logiciel !",
        "python": "J'ai utilisé Python pendant mon stage chez Autodesk et j'ai également développé un modèle d'apprentissage automatique lors du hackathon CodeML.",
        "csharp": "Avec Unity, j'ai développé un jeu 2D appelé 'All Rat Remains' en équipe de 5 lors du hackathon McGameJam.",
        "java": "J'ai développé une application de bureau en Java avec JavaFX ainsi qu'une application web avec Spring Boot.",
        "web": "En plus de ce site web, j'ai créé plusieurs applications web lors de hackathons et de projets scolaires.",
        "editors": "J'utilise principalement VS Code, mais j'aime aussi utiliser Vim lorsque je suis dans un terminal.",
        "databases": "J'ai de l'expérience pratique sur des projets utilisant PostgreSQL pour gérer la base de données relationnelles et Firebase NoSQL pour le stockage de données en temps réel.",
        "version_control": "J'ai de l'expérience avec différents systèmes de contrôle de version tels que Git et Perforce.",
        "other": "Lors de mes stages, j'ai acquis de l'expérience pratique avec divers outils comme Docker, Jenkins et Jira, ainsi qu'une exposition aux méthodologies Agile."
    },
    "internships": {
        "matrox": {
            "title": "Matrox, C++",
            "subtitle": "Stagiaire en développement logiciel",
            "duration": "Janvier - Décembre 2025",
            "info": [
                "Contribue actuellement à la maintenance et à l'amélioration du système de build et des outils de développement internes."
            ]
        },
        "autodesk": {
            "title": "Autodesk, C++",
            "subtitle": "Stagiaire en développement logiciel",
            "duration": "Mai - Août 2024",
            "info": [
                "Redesign de la fenêtre de gestion de projet d'Autodesk Flame en simplifiant la navigation et en introduisant quatre nouvelles fonctionnalités, réduisant le temps de gestion de projet d'environ 50 %.",
                "Optimisation des suites de tests automatisés en mettant à jour plus de 10 tests Python pour assurer leur compatibilité avec le nouveau design.",
                "Participation aux revues de code en utilisant Git et GitHub pour garantir la qualité du code."
            ]
        },
        "mirametrix": {
            "title": "Mirametrix Inc., C++",
            "subtitle": "Stagiaire en ingénierie logicielle",
            "duration": "Mai - Août 2023",
            "info": [
                "Correction de plus de 15 bugs dans l'application Qt, améliorant directement 20 % des fonctionnalités de l'application.",
                "Utilisation de Perforce comme principal système de contrôle de version pour gérer efficacement le code et suivre les modifications.",
                "Participation aux réunions quotidiennes Scrum pour assurer une communication ouverte et suivre l'avancement des tâches sur Jira.",
                "Réalisation de plus de 10 revues de code en fournissant des suggestions aux membres de l'équipe et en améliorant la qualité du code."
            ]
        }
    },
    "projects": {
        "GuessOrMess": {
            "title": "Jeu Web",
            "subtitle": "Guess Or Mess",
            "info": [
                "Développement de Guess or MESS, une plateforme d'étude interactive qui transforme les cartes Anki en jeux-questionnaires multijoueurs en temps réel, améliorant l'engagement grâce à des classements compétitifs.",
                "Utilisation de TypeScript, React.js et Tailwind CSS pour créer une interface utilisateur réactive et intuitive.",
                "Utilisation de Firebase pour les opérations backend, y compris le traitement des cartes, la gestion de l'état du jeu et l'hébergement web, garantissant évolutivité et fonctionnalité en temps réel."
            ],
            "link": "https://devpost.com/software/guess-or-mess?ref_content=my-projects-tab&ref_feature=my_projects",
            "images": [
                "guess_or_mess.png",
                "guess_or_mess2.png"
            ]
        },
        "FitHub": {
            "title": "Application Web Full Stack, Java",
            "subtitle": "FitHub",
            "info": [
                "Conception et développement d'une application web BOLD(full-stack) pour la gestion d'un centre sportif, permettant aux propriétaires et aux instructeurs de planifier des cours et aux clients de s'inscrire aux séances.",
                "Utilisation de Spring Boot et PostgreSQL pour le backend et de HTML, CSS et Vue.js pour le frontend.",
                "Implémentation d'API RESTful avec Spring Boot pour gérer les opérations CRUD, l'authentification des utilisateurs et la validation des données."
            ],
            "link": "https://github.com/McGill-ECSE321-Winter2024/FitHub/wiki/Screenshots",
            "images": [
                "FitHub_login.png",
                "FitHub_explore.png"
            ]
        },
        "AssetPlus": {
            "title": "Application de Bureau, Java",
            "subtitle": "AssetPlus",
            "info": [
                "Développement d'une application de bureau avec JavaFX en équipe de 6 pour suivre les actifs défectueux d'un hôtel.",
                "Optimisation du développement avec Umple et application du modèle MVC (Modèle-Vue-Contrôleur) pour une architecture modulaire.",
                "Réalisation de tests en appliquant les concepts du développement axé sur le comportement avec JUnit et Gherkin.",
                "BOLD(Gagnant) du titre de 'Meilleure Application' parmi 15 équipes après avoir présenté l'efficacité de l'application et ses fonctionnalités supplémentaires, telles que BOLD(le support multilingue)."
            ],
            "link": "https://github.com/F2023-ECSE223/ecse223-group-project-p12/wiki/Iterations-4%E2%80%905",
            "images": [
                "assetplus.png",
                "assetplus2.png"
            ]
        },
        "AllRatRemains": {
            "title": "Jeu 2D Unity, C#",
            "subtitle": "All Rat Remains - Hackathon McGameJam",
            "info": [
                "Collaboration avec 4 coéquipiers pour créer un jeu 2D en C#, intégrant des labyrinthes, des énigmes et une intrigue mystérieuse.",
                "Gagnant dans la catégorie 'Meilleur Design Audio'.",
                "Gestion efficace des implémentations du jeu avec Unity et Git."
            ],
            "link": "https://ethearian.itch.io/all-rat-remains",
            "images": [
                "all_rat_remains.png"
            ]
        },
        "CodeML": {
            "title": "Modèle de Machine Learning, Python",
            "subtitle": "Modèle de Prédiction des AVC - Hackathon CodeML",
            "info": [
                "Travail en équipe de 4 sur Google Colab pour développer un modèle d'intelligence artificielle en Python capable de prédire les risques d'AVC.",
                "Atteint le top 5 du classement avec le modèle développé.",
                "Entraînement du modèle avec des classificateurs de la bibliothèque Scikit-learn sur Google Colab, en analysant 2000 points de données.",
                "Apprentissage dans un atelier de machine learning sur l'entraînement de modèles pour reconnaître des vêtements."
            ],
            "link": "https://github.com/julia-b-grenier/tictactoe",
            "images": [
                "codeml.png"
            ]
        },
        "TicTacToe": {
            "title": "Jeu en C++",
            "subtitle": "TicTacToe",
            "info": [
                "Programmation d'un jeu Tic-Tac-Toe en C++ avec la bibliothèque de développement SFML."
            ],
            "link": "https://github.com/julia-b-grenier/tictactoe",
            "images": [
                "tictactoe1.png"
            ]
        }
    }
}
