{
    "en": {
        "name": "Julia B. Grenier",
        "title": "Software Engineering Co-op Student",
        "bio": "I'm a third-year Software Engineering Co-op student at McGill University. I love making games, software, and web apps!\nI'm also a member of GameDev, the game development student society at McGill University.\nWhen I'm not coding, I love playing badminton and trying out new board games.",
        "skills": {
            "cpp": "After making small projects and games using C++, I applied my knowledge during my first two software engineering internships!",
            "python": "I used my knowledge in Python to program a machine-learning model during the CodeML hackathon.",
            "csharp": "Using Unity, I developed a 2D game called 'All Rat Remains' in a team of 5 during the McGameJam Hackathon.",
            "java": "I developed a desktop application in Java using JavaFX and a web application using Spring Boot.",
            "web": "I am trying to learn more about web development by coding this website! I am using Bootstrap for responsive design and Vue.js.",
            "version_control": "I have experience using different version control systems such as Git and Perforce."
        },
        "internships": {
            "autodesk": {
                "title": "Autodesk, C++",
                "subtitle": "Software Developer Intern",
                "duration": "May - August 2024",
                "info": [
                    "Redesigned the project management window of the Flame software, improving the user experience and usability by adding BOLD(4 new features): list view, multi-selection, group deletion, and templates.",
                    "Adapted the automated testing suite by updating over BOLD(10 Python tests) to ensure compatibility with the newly redesigned project management window.",
                    "Collaborated with cross-functional teams, BOLD(scheduling meetings) to discuss the implementation of BOLD(scalable and adaptable software solutions), ensuring efficiency and attention to detail.",
                    "Contributed to the deployment process by BOLD(pushing configuration files to production), ensuring the client's environment utilized the latest and most efficient software libraries."
                ]
            },
            "mirametrix": {
                "title": "Mirametrix Inc., C++",
                "subtitle": "Software Engineer Intern",
                "duration": "May - August 2023",
                "info": [
                    "Identified and BOLD(resolved over 15 bugs) in the C++ codebase, showcasing strong problem-solving and debugging abilities and enhancing overall software quality.",
                    "Utilized BOLD(Perforce) as the primary version control system, effectively managing code, tracking changes, and facilitating adherence to a structured agile development process.",
                    "Engaged in BOLD(code reviews), providing suggestions to team members, resulting in improved code quality and adherence to best practices.",
                    "Participated in daily stand-up meetings following the BOLD(Scrum methodology) to foster open communication and provide updates on the progress of tasks tracked on BOLD(Jira), the project management tool."
                ]
            }
        },
        "projects": {
            "FitHub": {
                "title": "Full Stack Web Application, Java",
                "subtitle": "FitHub",
                "info": [
                    "Designed and developed a BOLD(full-stack) web application for managing a local sports center, providing a platform for owners and instructors to schedule classes and enabling customers to register for sessions.",
                    "BOLD(Spring Boot) for the backend, BOLD(Vue.js) for the frontend, and BOLD(PostgreSQL) for the database to create a seamless and efficient user experience.",
                    "RESTful APIs with Spring Boot to handle BOLD(CRUD) operations, user authentication, and data validation, ensuring secure and reliable data management."
                ],
                "link": "https://github.com/McGill-ECSE321-Winter2024/FitHub/wiki/Screenshots",
                "images": [
                    "FitHub_login.png",
                    "FitHub_explore.png"
                ]
            },
            "AssetPlus": {
                "title": "Desktop Application, Java",
                "subtitle": "AssetPlus",
                "info": [
                    "Developed a modern desktop application using Java and BOLD(JavaFX) in a team of 6 with an appealing UI that keeps track of defective assets in a hotel.",
                    "Utilized BOLD(Umple) to generate Java code from models, significantly reducing development time.",
                    "Implemented tests applying the concepts of behavior-driven development using BOLD(Junit), Gherkin, and Cucumber.io.",
                    "Employed Git to manage the codebase efficiently by making pull requests and reviewing and merging them.",
                    "BOLD(Won) the title 'Best Application' against 15 other teams after presenting the app's efficiency and showcasing the additional features added, such as BOLD(multi-language support)."
                ],
                "link": "https://github.com/F2023-ECSE223/ecse223-group-project-p12/wiki/Iterations-4%E2%80%905",
                "images": [
                    "assetplus.png",
                    "assetplus2.png"
                ]
            },
            "AllRatRemains": {
                "title": "2D Unity Game, C#",
                "subtitle": "All Rat Remains - McGameJam Hackathon",
                "info": [
                    "Collaborated with 4 teammates to create a 2D game in C# incorporating mazes, puzzles, and a mysterious plot.",
                    "Won the category 'Best Audio Design.'",
                    "Efficiently managed the game's implementations using Unity and Git."
                ],
                "link": "https://ethearian.itch.io/all-rat-remains",
                "images": [
                    "all_rat_remains.png"
                ]
            },
            "CodeML": {
                "title": "Machine Learning Model, Python",
                "subtitle": "Model Predicting the Risk of a Stroke - CodeML Hackathon",
                "info": [
                    "Worked in a team of 4 with Google Colab to build an artificial intelligence model in Python that predicts if someone will have a stroke.",
                    "Reached the top 5 of our ranking with the developed model.",
                    "Trained the model using classifiers from the Scikit-learn library on Google Colab to analyze 2000 data points.",
                    "Learned in a machine-learning workshop how to train a model to recognize clothing."
                ],
                "link": "https://github.com/julia-b-grenier/tictactoe",
                "images": [
                    "codeml.png"
                ]
            },
            "TicTacToe": {
                "title": "C++ Game",
                "subtitle": "TicTacToe",
                "info": [
                    "Programmed a Tic-Tac-Toe game in C++ with the SFML software development library."
                ],
                "link": "https://github.com/julia-b-grenier/tictactoe",
                "images": [
                    "tictactoe1.png"
                ]
            }
        }
    },
    "fr": {
        "name": "Julia B. Grenier",
        "title": "Étudiante en Génie Logiciel en Coop",
        "bio": "Je suis une étudiante en troisième année de Génie Logiciel en Coop à l'Université McGill. J'adore créer des jeux, des logiciels et des applications web !\nJe suis également membre de GameDev, la société étudiante de développement de jeux à l'Université McGill.\nQuand je ne code pas, j'aime jouer au badminton et essayer de nouveaux jeux de société.",
        "skills": {
            "cpp": "Après avoir réalisé de petits projets et jeux en utilisant C++, j'ai appliqué mes connaissances lors de mes deux premiers stages en génie logiciel !",
            "python": "J'ai utilisé mes connaissances en Python pour programmer un modèle d'apprentissage automatique lors du hackathon CodeML.",
            "csharp": "Avec Unity, j'ai développé en équipe de 5 un jeu 2D appelé 'All Rat Remains' lors du hackathon McGameJam.",
            "java": "J'ai développé une application de bureau en Java en utilisant JavaFX et une application web en utilisant Spring Boot.",
            "web": "J'essaie d'en apprendre davantage sur le développement web en codant ce site web ! J'utilise Bootstrap pour le design réactif et Vue.js.",
            "version_control": "J'ai de l'expérience avec différents systèmes de contrôle de version tels que Git et Perforce."
        },
        "internships": {
            "autodesk": {
                "title": "Autodesk, C++",
                "subtitle": "Stagiaire Développeur Logiciel",
                "duration": "Mai - Août 2024",
                "info": [
                    "Reconcevoir la fenêtre de gestion de projets du logiciel Flame, améliorant l'expérience utilisateur et l'utilisabilité en ajoutant BOLD(4 nouvelles fonctionnalités) : vue en liste, sélection multiple, suppression en groupe et modèles.",
                    "Adapter la suite de tests automatisés en mettant à jour plus de BOLD(10 tests Python) pour assurer la compatibilité avec la fenêtre de gestion de projets nouvellement redesignée.",
                    "Collaborer avec des équipes multifonctionnelles, BOLD(planifier des réunions) pour discuter de la mise en œuvre de BOLD(solutions logicielles évolutives et adaptables), garantissant l'efficacité et l'attention aux détails.",
                    "Contribuer au processus de déploiement en BOLD(poussant les fichiers de configuration en production), en veillant à ce que l'environnement du client utilise les bibliothèques logicielles les plus récentes et les plus efficaces."
                ]
            },
            "mirametrix": {
                "title": "Mirametrix Inc., C++",
                "subtitle": "Stagiaire Ingénieur Logiciel",
                "duration": "Mai - Août 2023",
                "info": [
                    "Identifié et BOLD(résolu plus de 15 bugs) dans la base de code C++, démontrant de solides capacités de résolution de problèmes et de débogage et améliorant la qualité globale du logiciel.",
                    "Utilisé BOLD(Perforce) comme système de contrôle de version principal, gérant efficacement le code, suivant les changements et facilitant l'adhésion à un processus de développement agile structuré.",
                    "Participé à des BOLD(revues de code), fournissant des suggestions aux membres de l'équipe, entraînant une amélioration de la qualité du code et du respect des meilleures pratiques.",
                    "Participé aux réunions quotidiennes en suivant la BOLD(méthodologie Scrum) pour favoriser la communication ouverte et fournir des mises à jour sur l'avancement des tâches suivies sur BOLD(Jira), l'outil de gestion de projet."
                ]
            }
        },
        "projects": {
            "FitHub": {
                "title": "Application Web Full Stack, Java",
                "subtitle": "FitHub",
                "info": [
                    "Conçu et développé une application web BOLD(full-stack) pour la gestion d'un centre sportif local, offrant une plateforme aux propriétaires et instructeurs pour planifier des cours et permettant aux clients de s'inscrire aux séances.",
                    "BOLD(Spring Boot) pour le backend, BOLD(Vue.js) pour le frontend et BOLD(PostgreSQL) pour la base de données pour créer une expérience utilisateur fluide et efficace.",
                    "APIs RESTful avec Spring Boot pour gérer les opérations BOLD(CRUD), l'authentification des utilisateurs et la validation des données, garantissant une gestion sécurisée et fiable des données."
                ],
                "link": "https://github.com/McGill-ECSE321-Winter2024/FitHub/wiki/Screenshots",
                "images": [
                    "FitHub_login.png",
                    "FitHub_explore.png"
                ]
            },
            "AssetPlus": {
                "title": "Application de Bureau, Java",
                "subtitle": "AssetPlus",
                "info": [
                    "Développé une application de bureau moderne en utilisant Java et BOLD(JavaFX) en équipe de 6 avec une interface utilisateur attrayante qui suit les actifs défectueux dans un hôtel.",
                    "Utilisé BOLD(Umple) pour générer du code Java à partir de modèles, réduisant considérablement le temps de développement.",
                    "Implémenté des tests appliquant les concepts de développement dirigé par le comportement en utilisant BOLD(Junit), Gherkin et Cucumber.io.",
                    "Employé Git pour gérer efficacement la base de code en faisant des demandes de tirage et en les révisant et fusionnant.",
                    "BOLD(Gagné) le titre de 'Meilleure Application' contre 15 autres équipes après avoir présenté l'efficacité de l'application et mis en avant les fonctionnalités supplémentaires ajoutées, telles que BOLD(le support multilingue)."
                ],
                "link": "https://github.com/F2023-ECSE223/ecse223-group-project-p12/wiki/Iterations-4%E2%80%905",
                "images": [
                    "assetplus.png",
                    "assetplus2.png"
                ]
            },
            "AllRatRemains": {
                "title": "Jeu 2D Unity, C#",
                "subtitle": "All Rat Remains - Hackathon McGameJam",
                "info": [
                    "Collaboré avec 4 coéquipiers pour créer un jeu 2D en C# intégrant des labyrinthes, des puzzles et une intrigue mystérieuse.",
                    "Gagné la catégorie 'Meilleur Design Audio.'",
                    "Géré efficacement les implémentations du jeu en utilisant Unity et Git."
                ],
                "link": "https://ethearian.itch.io/all-rat-remains",
                "images": [
                    "all_rat_remains.png"
                ]
            },
            "CodeML": {
                "title": "Modèle d'Apprentissage Automatique, Python",
                "subtitle": "Modèle Prédictif du Risque d'Accident Vasculaire Cérébral - Hackathon CodeML",
                "info": [
                    "Travaillé en équipe de 4 avec Google Colab pour construire un modèle d'intelligence artificielle en Python qui prédit si quelqu'un aura un AVC.",
                    "Atteint le top 5 de notre classement avec le modèle développé.",
                    "Entraîné le modèle en utilisant des classificateurs de la bibliothèque Scikit-learn sur Google Colab pour analyser 2000 points de données.",
                    "Appris dans un atelier sur l'apprentissage automatique comment entraîner un modèle à reconnaître des vêtements."
                ],
                "link": "https://github.com/julia-b-grenier/tictactoe",
                "images": [
                    "codeml.png"
                ]
            },
            "TicTacToe": {
                "title": "Jeu C++, Tic-Tac-Toe",
                "subtitle": "TicTacToe",
                "info": [
                    "Programmé un jeu de Tic-Tac-Toe en C++ avec la bibliothèque de développement logiciel SFML."
                ],
                "link": "https://github.com/julia-b-grenier/tictactoe",
                "images": [
                    "tictactoe1.png"
                ]
            }
        }
    }
}
